<!DOCTYPE html>
<html lang="fr">

<head>
	<title>Pourquoi le cartonnage num&eacute;rique ?</title>
	<meta http-equiv="content-type" content="text/html;charset=utf-8" />
	<meta name="generator" content="Geany 1.35" />
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="https://www.w3schools.com/w3css/4/w3.css">
  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">
  <!--link rel="stylesheet" href="https://gilboonet.github.io/index.css"-->
  <link rel="icon" href="favicon.ico" type="image/x-icon">
  <style>
		h1 {font-size:4vw;}
		p {font-size:1.7vw;}
  </style>
</head>

<body>
	<div class="w3-container w3-center">
	<h1 class="w3-wide">Pourquoi le cartonnage num&eacute;rique ?</h1>
	</div>
	
	<div class="w3-container">

	<div class="w3-row w3-blue">
		<div class="w3-col s3"><img src="img/A2A.jpg" style="width:100%"></div>
		<div class="w3-col s3"><img src="img/A2B.jpg" style="width:100%"></div>
		<div class="w3-col s6 w3-justify">
			<p class="w3-margin">depuis 2015 je m'&eacute;chine &agrave; dire que je suis <span class="w3-tag w3-round w3-white w3-center">cartonniste num&eacute;rique</span>. Je cartonnais alors depuis de nombreuses ann&eacute;es quand j'ai voulu faire un meuble que j'avais mod&eacute;lis&eacute; avec un logiciel. Le r&eacute;sultat a &eacute;t&eacute; d&eacute;cevant, non seulement je n'ai pas pu fermer la structure de façon esth&eacute;tique, mais de nombreux endroits n'avaient pas le volume escompt&eacute;. C'est alors que j'ai entrepris un long cheminement qui m'a permis de d&eacute;composer tout volume en gabarit en carton qu'il suffit d'assembler pour en obtenir une copie fid&egrave;le.</p>
		</div>
	</div>
	<div class="w3-row w3-teal">
		<p class="w3-margin">J'avais mod&eacute;lis&eacute; ce meuble dans le cadre de recherches sur les volumes galb&eacute;s que je ne parvenais pas &agrave; obtenir avec la technique des traverses.</p>
	</div>
	<div class="w3-row w3-orange w3-margin-top">
		<div class="w3-col s4"><img src="img/A2C.jpg" style="width:100%"></div>
		<div class="w3-col s8 w3-justify">
			<p class="w3-margin">J'ai commenc&eacute; mes recherches d'une nouvelle façon de cr&eacute;er en carton en explorant manuellement les formes faisables &agrave; l'aide de triangles. J'ai rapidement d&eacute;velopp&eacute; comme meilleure hypoth&egrave;se l'utilisation conjointe d'un squelette et d'un habillage, mais ce qui coinçait &eacute;tait le nombre de triangles que je parvenais &agrave; g&eacute;rer manuellement.</p>
		</div>
	</div>

	<div class="w3-row w3-amber w3-margin-top">
		<div class="w3-col s8 w3-justify">
			<p class="w3-margin">C'est alors que j'ai pris la d&eacute;cision de concevoir mes cr&eacute;ations carton en num&eacute;rique. J'ai alors initi&eacute; le projet <span class="w3-tag w3-round w3-white w3-center">Cartonner 3D</span>, et qui a couvert petit &agrave; petit tous les domaines cr&eacute;atifs qui m'&eacute;taient accessibles grâce au num&eacute;rique. Cependant, ce projet a eu un pr&eacute;-requis de taille : l'acc&egrave;s &agrave; un outil de d&eacute;coupe num&eacute;rique.</p>
		</div>
		<div class="w3-col s4"><img src="img/A2D.png" style="width:100%"></div>
	</div>

	<div class="w3-row w3-purple w3-margin-top">
		<div class="w3-col s4"><img src="img/A2E.jpg" style="width:100%"></div>
		<div class="w3-col s8 w3-justify">
			<p class="w3-margin">La seule solution qui m'&eacute;tait accessible &eacute;tait l'auto-construction, j'ai donc lanc&eacute; le projet <span class="w3-tag w3-round w3-white w3-center">CNC</span> qui m'a conduit &agrave; la fabrication de ma premi&egrave;re machine d&eacute;coupeuse laser. La d&eacute;coupe laser qui n'&eacute;tait pas pr&eacute;vue au d&eacute;but s'est vite av&eacute;r&eacute;e int&eacute;ressante parce qu'elle ne n&eacute;cessite pas de contact avec la mati&egrave;re et donc peut se suffire d'une motorisation l&eacute;g&egrave;re. Au d&eacute;but j'ai utilis&eacute; un laser d'une puissance de 2 Watts qui ne permettait que de couper du simple cannelure, et depuis 2 ans maintenant j'utilise un laser de 15 W qui peut d&eacute;couper du double cannelure m&ecirc;me si c'est en plusieurs passes.</p>
		</div>
	</div>

	<div class="w3-row w3-deep-orange w3-margin-top">
		<div class="w3-col s8 w3-justify">
			<p class="w3-margin">Afin de bien cerner les besoins du cartonnage en num&eacute;rique, j'ai num&eacute;ris&eacute; la plupart de mes cr&eacute;ations existantes, essentiellement les meubles, plus d'une cinquantaine. Cela m'a permis de d&eacute;velopper des outils adapt&eacute;s &agrave; la conception de chaque type de meuble :</p>
			<ul>
				<li>le meuble simple : le profil et les niches sont dessin&eacute;s</li>
				<li>le meuble en r&eacute;seau de niches : le profil et les niches sont reli&eacute;s par des points que l'on peut d&eacute;placer</li>
				<li>le meuble kal&eacute;idoscopique composite  : le meuble est un pavage circulaire</li>
			</ul>
		</div>
		<div class="w3-col s4"><img src="img/A2F.png" style="width:100%"></div>
	</div>

	<div class="w3-row w3-amber w3-margin-top">
		<div class="w3-col s8 w3-justify">
			<p class="w3-margin">Apr&egrave;s avoir travaill&eacute; plusieurs mois sur un logiciel permettant de d&eacute;composer un mod&egrave;le 3d en gabarit de d&eacute;coupe de son squelette, je me suis trouv&eacute; devant une impasse pour le calcul des plaques d'habillage. Cela m'a amen&eacute; &agrave; d&eacute;velopper le projet <span class="w3-tag w3-round w3-white w3-center">D&eacute;pliage</span></p>
		</div>
		<div class="w3-col s4"><img src="img/A2G.png" style="width:100%"></div>
	</div>			

	<div class="w3-row w3-cyan w3-margin-top">
		<div class="w3-col s6"><img src="img/A2H.png" style="width:100%"></div>
		<div class="w3-col s6 w3-justify">
			<p class="w3-margin">Le d&eacute;pliage num&eacute;rique a &eacute;t&eacute; un projet men&eacute; en plusieurs &eacute;tapes, tout d'abord il y en a eu une version manuelle tr&egrave;s fastidieuse, mais qui permettait d'obtenir des d&eacute;pliages faciles &agrave; faire. Cela m'a permis de d&eacute;plier des mod&egrave;les ayant jusqu'&agrave; 800 facettes. Puis, j'ai &eacute;crit une version automatique avec laquelle j'ai d&eacute;pli&eacute; plusieurs mod&egrave;les comportant 2000 facettes.</p>
		</div>
	</div>

	<div class="w3-row w3-cyan">
		<div class="w3-col s6"><img src="img/A2I.png" style="width:100%"></div>
		<div class="w3-col s6 w3-justify">
			<p class="w3-margin">Enfin, j'ai ajout&eacute; la possibilit&eacute; de pr&eacute;parer des sections &agrave; d&eacute;plier s&eacute;par&eacute;ment. Cette s&eacute;paration permet non seulement de grandement acc&eacute;l&eacute;rer le calcul, mais il optimise l'assemblage et permet dans le cas de structure g&eacute;om&eacute;triques (comme les vases ou le mobilier) de pouvoir &eacute;liminer les num&eacute;ros du gabarit.</p>
		</div>
	</div>

	<div class="w3-row w3-deep-purple w3-margin-top">
		<div class="w3-col s6"><img src="img/A2J.png" style="width:100%"></div>
		<div class="w3-col s6 w3-justify">
			<p class="w3-margin">D&eacute;but 2020, j'ai lanc&eacute; le site <a href="https://gilboonet.github.io" target="_blank">gilboonet.github.io</a> pour pr&eacute;senter les diff&eacute;rentes techniques de cartonnage num&eacute;rique que j'utilise et surtout mettre en ligne les outils de calcul des gabarits depuis un mod&egrave;le 3d.</p>
			<p class="w3-margin w3-light-green">C'est un outil artisanal pr&eacute;vu en priorit&eacute; pour &ecirc;tre utilis&eacute; sur pc, mais il fonctionne aussi sur tablette.</p>
		</div>
	</div>

	<div class="w3-row w3-yellow w3-margin-top">
		<div class="w3-col s6"><img src="img/A2K.png" style="width:100%"></div>
		<div class="w3-col s6 w3-justify">
			<p class="w3-margin">L'outil permettant de cr&eacute;er un gabarit depuis un mod&egrave;le 3d est <a href="https://gilboonet.github.io/OpenJSCAD.org/packages/web/scripts.html" target="_blank">ici</a>. Il est possible de l'utiliser pour cr&eacute;er un <a href="https://gilboonet.github.io/#M5" target="_blank">volume en tranches</a>, en <a href="https://gilboonet.github.io/#M6" target="_blank">squelette entrecrois&eacute;</a>, ou <a href="https://gilboonet.github.io/#M7" target="_blank">en facettes</a>. Il aussi possible de cr&eacute;er du mobilier en associant un squelette et un habillage en facettes.</p>
			<p class="w3-margin w3-light-green">Le meuble est vraiment en volume, les façades comme les profils ne sont pas nécessairement planes. Il convient cependant de respecter des épaisseurs de cloisons inhérentes au carton.</p>
		</div>
	</div>

	<div class="w3-row w3-yellow">
		<div class="w3-col s5"><img src="img/A2L.jpg" style="width:100%"></div>
		<div class="w3-col s7 w3-justify">
			<p class="w3-margin">Pour que les deux &eacute;l&eacute;ments composant le meuble soient correctement ajust&eacute;s, il faut faire attention &agrave; cr&eacute;er le squelette en reduisant l&eacute;g&egrave;rement son &eacute;chelle par rapport &agrave; celle de l'habillage de façon &agrave; ce que sa hauteur soit &eacute;gale &agrave; la hauteur de l'habillage moins deux fois l'&eacute;paisseur du carton d'habillage.</p>
		</div>
	</div>
	
	<div class="w3-cell-row w3-green w3-margin w3-justify">
		<p class="w3-margin">J'ai fait ce travail pour que la cr&eacute;ation en carton devienne accessible au plus grand nombre. Aujourd'hui tout ce que l'on peut mod&eacute;liser peut &ecirc;tre fait en carton simplement en reproduisant ses gabarits calcul&eacute;s. La d&eacute;coupe num&eacute;rique est encore loin d'&ecirc;tre pr&eacute;sente partout, mais elle est disponible dans la plupart des FabLabs et l'on peut s'&eacute;quiper pour moins en moins cher. De plus, il est tout &agrave; fait possible d'imprimer un gabarit sur papier puis de continuer sur carton &agrave; la main.</p>
		<p class="w3-margin w3-light-green">J'envisage de commencer &agrave; produire des mod&egrave;les de mobilier standard qui pourront &ecirc;tre utilis&eacute;s par ceux qui ne savent pas mod&eacute;liser eux-m&ecirc;mes. Toute proposition de mod&egrave;le, tous avis sont bienvenus.</p>
		<p class="w3-margin w3-orange w3-center"><a href="mailto:gilbertfd@gmail.com?subject=Depuis gilboonet.github.io">Me contacter</a></p>
	</div>
	
</body>

</html>
